'use strict'


// 1. Зайдите в консоль своего браузера. При помощи оператора определения типа уточните тип следующих величин: «Привет», 123, true, «true».
// let a = 'Привет';
// console.log(typeof a);
// let b = 123;
//  console.log(typeof b);
//  let c = true;
//  console.log(typeof c);
//  let d = 'true';
//  console.log(typeof d);



// 2. Зайдите в консоль своего браузера. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений: 5 + 3, 5 — 3, 5 * 3, 5 / 3.
// let a = 5;
// let b = 3;
// let result;
// console.log(a+b,a-b,a*b,a/b);




// 3. Зайдите в консоль своего браузера. При помощи оператора нахождения остатка от деления %, найдите значения выражений: 5 % 3, 3 % 5.
// let a = 5;
// let b = 3;
// let result;
// console.log(a%b,b%a);




// 4. Зайдите в консоль своего браузера. При помощи оператора + (сложение, склеивание) найдите значения выражений: 5 + ‘3’ , ‘5’ — 3, 75 + ‘кг’.
// let a = 5;
// let b = `3`;
// let c = `5`;
// let d = 3;
// let e = 75;
// let f = `кг`;
// console.log (a+b,c-d,e+f);


// 5. Создайте переменные строкового, числового и булева типов. Выведите их содержимое.
// let a = "hi";
// let b = 50;
// let c = true;
// console.log(typeof a);
// console.log(typeof b);
// console.log(typeof c);




// 6. Напишите скрипт, который находит площадь прямоугольника длиной 23см., шириной 10см.
// let a = 23;
// let b = 10;
// console.log(a*b);

// 7. (*) Найди двенадцатый элемент последовательности Леонардо Пизанского (нужно использовать функцию Math.pow(число, степень))


// 8. (*) Даны размер ипотечного кредита, процентная ставка, кол-во лет. Найти переплату по кредиту.

// _________________________________
// 9) Створіть змінну num і надайте їй значення 3. Виведіть значення цієї змінної на екран за допомогою методу alert
// const num = 3;
// alert(num);



// 10) Створіть змінні a = 10 і b = 2. Виведіть на екран їх суму, різницю, добуток і частку (результат ділення)
// let a = 10;
// let b = 2;
// let result;
// console.log(a+b);
// console.log(a-b);
// console.log(a*b);
// console.log(a/b);



// 11) Створіть змінні c = 15 і d = 2. Підсумуйте їх, а результат надайте змінної result. Виведіть на екран значення змінної result
// let c = 15;
// let d = 2;
// let result = c+d;
// console.log(result);

// 12) Створіть змінні a = 10, b = 2 і c = 5. Виведіть на екран їх суму.
// let a = 10;
// let b = 2;
// let c= 5;
// let result;
// console.log(a+b+c);

// 13) Створіть змінні a = 17 і b = 10. Відніміть від a змінну b і результат надайте зміннії c. Потім створіть змінну d, надайте їй значення 7. Складіть змінні c і d, а результат запишіть в змінну result. Виведіть на екран значення змінної result.
// let a = 17;
// let b = 10;
// let c =a -b;
// let d = 7;
// let result = c+d;
// console.log(result)

// 14) Запитайте ім'я користувача за допомогою методи prompt. Виведіть за допомогою alert повідомлення 'Ваше ім'я
// %значення що отримали з prompt%'

// var name = prompt('Ваше имя ');
// alert( name )


// 15) Створіть три змінні - година, хвилина, секунда. З їх допомогою виведіть поточний час в форматі 'година: хвилина: секунда'.
// let a = '12:';
// let b = '33:';
// let c = '54';
// alert('година '+ a);
// alert ('хвилина ' + b);
// alert ('секунда ' + с);???????????????????



// 16) Створіть змінну, надайте їй число. Зведіть це число в квадрат. Виведіть його на екран
// let a = 10;
// alert (a * a);

// 17) Переробіть цей код так, щоб в ньому використовувалися операції + =, - =, * =, / =. Кількість рядків коду при цьому не повинно змінитися.

//   var num  = 47;
//   num = num + 7;
//   num = num - 18;
//   num = num * 10;
//   num = num / 15;
//   alert (num);


// 18) Створіть змінну str і надайте їй значення 'Hello World'. Виведіть значення цієї змінної на екран
// let str = 'Hello World!';
// alert(str);


// 19) Створіть змінні str1 = 'Hello,' і str2 = 'World!'. За допомогою цих змінних і операції додавання рядків виведіть на екран фразу 'Hello World'.
// let str1=' Hello'
// let str2=' World'
// alert(str1 + str2);


// 20) Створіть змінну name і надайте їй ваше ім'я. Створіть змінну age і надайте їй ваш вік. Виведіть на екран 'Привіт, я  % Ім'я%!'Мені% Вік% років!'.

// const name = ' Максим ' 
// const age = 28; 
// const sameMessage = `Привіт, я ${name} Мені ${age} років!.`;
// console.log(sameMessage);

// 21) Створіть змінну str і надайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка виведіть на екран символ 'a', символ 'c', символ 'e'
// let str = 'abcde';
// alert (str.charAt(0));
// alert (str.charAt(2));
// alert (str.charAt(4));

// 22) Створіть змінну num і надайте їй значення '12345'. Знайдіть суму, різницю, добуток, частку цифр цього числа
// і виведіть ці значення в консоль
// let num = '12345';
// ????????



// 23) Дана рядок 'js'. Зробіть з неї рядок 'JS'.
// let js = 'js';
// alert( hello.toUpperCase() );


// 24) Дана рядок 'JS'. Зробіть з неї рядок 'js'
// let js = 'JS';
// alert( js.toLowerCase() );

// 25) Дана рядок 'я вчу javascript!'. Знайдіть кількість символів в цьому рядку.
// let I = 'я вчу javascript!';
// alert (I.length);

// 26) Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
// let a = 10;
// let d = 3
// console.log (a%d);
// 27) Возведите 2 в 10 степень. Результат запишите в переменную st.
// let a = 2;
// let b = 10;
// let st = 1024;
// console.log(Math.pow(a,b));


// 28) Найдите квадратный корень из 245.
// console.log(Math.sqrt(245));

// 29) Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до сотых. (toFixed(0))
// console.log(Math.sqrt(379));
// let n = 19.467922333931785;
// console.log( n.toFixed(0) );
// console.log( n.toFixed(1) );
// console.log( n.toFixed(2) );


// 30) Найдите квадратный корень из 587. Округлите результат в большую и меньшую стороны (edited) 
// Перечень методов для работы со строками
// console.log(Math.sqrt(587));
// let n = 24.228082879171435;
// console.log(Math.ceil(n));
// console.log(Math.floor(n));
