// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// const alpha = ['a', 'b', 'c'];
// const numeric = [1, 2, 3];
// const alphaNumeric = alpha.concat(numeric);
// console.log(alphaNumeric);

// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// const alpha = ['a', 'b', 'c'];
// alpha.push(1);
// alpha.push(2);
// alpha.push(3);
// console.log(alpha);

// 3) Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// var alpha = [1, 2, 3];
// var numeric = [4, 5, 6];
// var alphaNumeric = alpha.concat(numeric);
// console.log(alphaNumeric);

// 4) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
// const number = [1, 2, 3];
// number.reverse();
// console.log (number);

// 5) Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// const numeric = [1, 2, 3];
// numeric.push(4,5,6);
// console.log(numeric);


// 6) Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// const numeric = [1, 2, 3];
// numeric.unshift(4,5,6);
// console.log(numeric);

// 7)  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
// const language = ['js', 'css', 'jq']; 
// console.log (language[0]);

// :sunglasses: Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
// const sunglasses = ['js', 'css', 'jq'];
// console.log (sunglasses[2]);

// 9) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// const number = [1, 2, 3, 4, 5];
// console.log (number.slice(0,3))

// 10) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]. 
// const number = [1, 2, 3, 4, 5];
// console.log (number.slice(-2));

// 11) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// const number = [1, 2, 3, 4, 5];
// const deletedNumber = number.splice(1,2);
// console.log (number);

// 12)  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. 
// const number = [1, 2, 3, 4, 5];
// const number1 = number.splice(1,3);
// console.log (number1) ;

// 13) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// const number = [1, 2, 3, 4, 5];
// number.splice (3, 0, 'a', 'b', 'c')
// console.log (number);

// 14) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. 
// const number = [1, 2, 3, 4, 5];
// number.splice (1, 0, 'a', 'b');
// number.splice (6, 0, 'c');
// number.splice(8, 0, 'e');
// console.log (number);






// // 1) Вибираємо випадкове число (від 0 до довжини масива);
// // 2) Записати в змінну звернення типу масив[індекс];
// // 3) Вивести змінну з пунтку 2 в алерт;
// let index = Math.floor(Math.random()*animals.length);
// alert(animals[index]);


// 1) Через prompt вводимо свій варіант тваринки
// 2) Варіант компютера записати в змінну
// 3) Порівнюємо наш варіант з копютерним
// 3,1) Якщо варіанти співпали тоді виводимо алертом що юзер виграва.
// 3,2) Якщо варіанти не співпали кажемо що користувач програв і виводимо варіант компютера.


// Написати гру Камінь Ножиці Папір.
// Варіанти вибору потрібно зберігати в масиві
// Користувач вводить свій варіант
// Компютер вибирає свій рандомний варівант з масиву
// Первіряємо вибір користувача і вибір компютера. 
// Опрацювати всі варіанти:
// 1) Варіанти де виграє користувач
// 2) Варіанти де виграє компютер
// 3) Варіанти де виходить нічия.


// 1) Записуємо в змінну строку з промта
// 2) Зробити строку масивом
// 3) Скопіювати масив
// 4) Реверсимо масив
// 5) З масивів робимо строки
// 6) Порівнюємо дві строки і виводимо результат в консоль; 

let logins = ['rew', 'qwewwe', 'apple', 'js', 'row', 'col']

// 1) Запитати логін
// 2) Перевірити чи існує логін в базі
// 3) Якщо логін існує вивести алерт ("Такий логін вже існує")
// 4) Якщо логін не існує вивести алерт ("Вітаємо") 